# ex5_25.py
# (1) 絕對值函數
f1 = lambda x: x if x > 0 else -x
print(f"(1) f1(-5)= {f1(-5)}, f1(2)= {f1(2)}") 

# (2) 判斷是否為偶數
f2 = lambda x: x % 2 == 0
print(f"(2) 10為偶數? {f2(10)}, 7為偶數? {f2(7)}") 

# (3) 計算串列內所有數字的平方和
f3 = lambda lst: sum(i**2 for i in lst)
print(f"(3) [1, 2, 3, 4]的平方和= {f3([1, 2, 3, 4])}")

# (4) 取出串列中所有的偶數
f4 = lambda lst: [i for i in lst if i % 2 == 0]
print(f"(4) [1, 2, 3, 4, 5, 6]中的偶數: {f4([1, 2, 3, 4, 5, 6])}")

'''output------------------------------------
(1) f1(-5)= 5, f1(2)= 2
(2) 10為偶數? True, 7為偶數? False
(3) [1, 2, 3, 4]的平方和= 30
(4) [1, 2, 3, 4, 5, 6]中的偶數: [2, 4, 6]
------------------------------------------'''