# ex6_5.py
# (a) 試將 [2, 12] 裡的元素添加到 lst 的後面，然後計算 12 在 lst 裡出現幾次
lst_a = [43, 12, 12, 34]
lst_a.extend([2, 12])
count_12 = lst_a.count(12)
print("(a)", lst_a, ", 12 出現次數:", count_12)

# (b) 試將整個串列 [25, 99] 添加到 lst 中
lst_b = [43, 12, 12, 34]
lst_b.append([25, 99])
print("(b)", lst_b)

# (c) 將 65 插入 lst 中，索引為 2 的位置
lst_c = [43, 12, 12, 34]
lst_c.insert(2, 65)
print("(c)", lst_c)

# (d) 移除 lst 中，元素值為 12 的元素（有兩個）
lst_d = [43, 12, 12, 34]
lst_d.remove(12)
lst_d.remove(12)
print("(d)", lst_d)

# (e) 將 lst 由大到小排序
lst_e = [43, 12, 12, 34]
lst_e.sort(reverse=True)
print("(e)", lst_e)

# (f) 移除 lst 的最後一個元素之後，再移除索引為 2 的元素
lst_f = [43, 12, 12, 34]
lst_f.pop()  # 移除最後一個元素
lst_f.pop(2) # 移除索引為 2 的元素
print("(f)", lst_f)

'''output----------------------------------------
(a) [43, 12, 12, 34, 2, 12] , 12 出現次數: 3
(b) [43, 12, 12, 34, [25, 99]]
(c) [43, 12, 65, 12, 34]
(d) [43, 34]
(e) [43, 34, 12, 12]
(f) [43, 12]
----------------------------------------------'''