# ex4_33.py
lower_limit = 0
upper_limit = 255

# 輸入一個由整數組成的串列
nums_input = eval(input("請輸入一串數字，用逗號分隔："))

# 判斷是否所有數字都在範圍內
for num in nums_input:
    if num < lower_limit or num > upper_limit:
        print("最少有一個數不在 [0, 255] 之內")
        break
else:
    print("輸入的數全在範圍之內")

'''output------------------------------------
請輸入一串數字，用逗號分隔：[9,12,-1,32,-8]
最少有一個數不在 [0, 255] 之內
------------------------------------------'''

'''output------------------------------------
請輸入一串數字，用逗號分隔：[9,12,3,32]
輸入的數全在範圍之內
------------------------------------------'''