# ex9_2.py
import numpy as np
print("\n(a) 建立二維陣列")
a = np.array([[4, 7],
              [8, 12]])
print(a)

print("\n(b) 建立二維陣列")
b = np.array([[7.4],
              [6.7],
              [2.0]])
print(b)

print("\n(c) 建立二維陣列")
c = np.array([[7, 4],
              [6, 7],
              [9, -5]])
print(c)

print("\n(d) 建立二維陣列")
d = np.array([[1, 2, 3],
              [4, 5, 6],
              [7, 8, 9]])
print(d)

'''output-----------
(a) 建立二維陣列
[[ 4  7]
 [ 8 12]]

(b) 建立二維陣列
[[7.4]
 [6.7]
 [2. ]]

(c) 建立二維陣列
[[ 7  4]
 [ 6  7]
 [ 9 -5]]

(d) 建立二維陣列
[[1 2 3]
 [4 5 6]
 [7 8 9]]
-----------------'''