# ex2_18.py
a = 12670
b = 12.344

# (a) (a) a顯示為右對齊，寬度為7，前面2個空格；b顯示為2位小數，寬度為6
print(f'(a) a={a:>7}, b={b:6.2f}')

# (b) a顯示為正數符號，b顯示為固定寬度，並四捨五入到2位小數，寬度為6，補零
print(f'(b) a= {a:+}, b={b:06.2f}')

# (c) a顯示為帶千位分隔符，b顯示為固定寬度並四捨五入到1位小數，寬度為6，補零
print(f'(c) a={a:+,}, b={b:06.1f}')

# (d) a顯示為帶千位分隔符，b顯示為右對齊，寬度為5，四捨五入到0位小數，補零
print(f'(d) a={a:0>7,.0f}, b={b:>5.0f}')

# (e) a顯示為大括號括起來，b顯示為固定寬度，12前面2個空格，四捨五入到0位小數
print(f'(e) a={{{a}}}, b=\'{b:>4.0f}\'')

'''output----------------------------
(a) a=  12670, b= 12.34
(b) a= +12670, b=012.34
(c) a=+12,670, b=0012.3
(d) a=012,670, b=   12
(e) a={12670}, b='  12'
----------------------------------'''