# ex3_17.py
data = [10, 20, 30, 40, 50, 60, 70, 80]

a = data[2:]
print(f"(a) 提取索引2之後的所有元素: {a}")

b = data[1:6]
print(f"(b) 提取索引1到5的元素: {b}")

c = data[:3]
print(f"(c) 提取前三個元素: {c}")

d = data[-3:]
print(f"(d) 提取最後三個元素: {d}")

e = data[0:7:2]
print(f"(e) 提取索引0到6間隔2的元素: {e}")

f = data[:3]
print(f"(f) 提取索引3之前的所有元素: {f}")

g = data[::-1]
print(f"(g) 以相反順序提取所有元素: {g}")

h = data[1::2]
print(f"(h) 提取索引1之後的所有偶數索引元素: {h}")

'''output------------------------------------------------------
(a) 提取索引2之後的所有元素: [30, 40, 50, 60, 70, 80]
(b) 提取索引1到5的元素: [20, 30, 40, 50, 60]
(c) 提取前三個元素: [10, 20, 30]
(d) 提取最後三個元素: [60, 70, 80]
(e) 提取索引0到6間隔2的元素: [10, 30, 50, 70]
(f) 提取索引3之前的所有元素: [10, 20, 30]
(g) 以相反順序提取所有元素: [80, 70, 60, 50, 40, 30, 20, 10]
(h) 提取索引1之後的所有偶數索引元素: [20, 40, 60, 80]
------------------------------------------------------------'''